def string_filter(text):
	import re
	filter_list13 = ["자댕이",'개새끼','씹','느개비','좆','노무현',
		"느개비",'느금마','니애미','빠구리','시발년','시발새끼',
		'느그앰','느그미','노무혐','빠9리','시발롬','시발련',
		'보빨러','사까시','걸레년','걸레련','보빨','4카시','사카시'
		,'봊','보전깨','오피누','오피녀','고무통','이기야','십색기','십색갸','십색꺄']
	filter_list2 = ["페미","냄져","한남","씨발",'섹스','개년','애미','애비','창녀','홍어','후빨'
			,'셋스','시발','보지','잠지','등신','빨통',"씨팔",'니미','엠창','틀딱','응디','놈현'
			,'느금','창년','걸레','보빨','니엄','콘돔',"걸레",'병신','빙신','갈보','섻스','쎅스','ㅅㅂ','ㅈㄹ'
			,'족같','붕알','부랄','무현','ㅆㅂ','ㅆ발','니앰','니엄','좆팔','놈딱','북딱','지잡','자지','씨팔']
	if any(text.find(i) != -1 for i in filter_list13):
		return False
	for i in filter_list2:
		r1 = re.search(i,text)
		r2 = re.search(i[0] + "." + i[1],text)
		r3 = re.search(i[0] + ".." + i[1],text)
		if r1 or r2 or r3:
			return False
	return True